# Replace
Changing values in the data using the replace() function.

In [1]:
import numpy as np
import pandas as pd

from pandas import Series

### Series

In [2]:
ser1 = Series(np.arange(8))

ser1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: int32

In [3]:
ser1.replace(0,'$',inplace=True)

ser1

0    $
1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: object

In [4]:
ser1.replace(['$',3],[11,12])

0    11
1     1
2     2
3    12
4     4
5     5
6     6
7     7
dtype: int64

In [5]:
ser1.replace({2:55})

0     $
1     1
2    55
3     3
4     4
5     5
6     6
7     7
dtype: object

In [6]:
ser1.replace(4, method='bfill')   #bfill -> fill backwards
                                  #ffil -> fill forwards

0    $
1    1
2    2
3    3
4    5
5    5
6    6
7    7
dtype: object

### DataFrames

In [7]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                   'B': [6, 7, 8, 9, 10],
                   'C': ['c1', 'c2', 'c3', 'c4', 'c5']})
df

   A   B   C
0  1   6  c1
1  2   7  c2
2  3   8  c3
3  4   9  c4
4  5  10  c5

In [8]:
df.replace([1, 2, 3], 4)

   A   B   C
0  4   6  c1
1  4   7  c2
2  4   8  c3
3  4   9  c4
4  5  10  c5

In [9]:
df.replace([1, 2, 3, 4], [4, 3, 2, 1])

   A   B   C
0  4   6  c1
1  3   7  c2
2  2   8  c3
3  1   9  c4
4  5  10  c5

In [10]:
df.replace({'A': 1, 'B': 6}, 100)

     A    B   C
0  100  100  c1
1    2    7  c2
2    3    8  c3
3    4    9  c4
4    5   10  c5

In [11]:
df.replace({'C': {'c1': 100, 'c4': 100}})

   A   B    C
0  1   6  100
1  2   7   c2
2  3   8   c3
3  4   9  100
4  5  10   c5